"""PROBLEM 14:

Создать 5 переменных:

a.Чётное число

b.Любое от 5 до 15

c.Дробное число до 20

d.Любое нечётное число

e.Любое число"""

a = 6
b = 7
c = 15
d = 9
e = 11

print(a, b, c, d, e)