"""PROBLEM 10:

Найдите средне арифмитическое чисел:25, 75, 10, 95."""

a = 25
b = 75
c = 10
d = 95
result = (a + b + c + d) / 4
print('средне арифмитическое число: ', result,)