"""PROBLEM 17:

Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой. Первые 2 переменные между собой сложить и умножить на 3 переменную."""


a = 7.4
b = 7.4
c = 7.4
d = (a + b) * c

print(d)