# Задача № 1 Что больше или равно числа 17925:

"""(34**2)

(26*3)

(17*33)

(4394*4)"""

a = (34**2) >= 17925
b = (26*3) >= 17925
c = (17*33) >= 17925
d = (4394*4) >= 17925

print(a)
print(b)
print(c)
print(d)

a = (34**2)
b = (26*3)
c = (17*33)
d = (4394*4)

if a > 17925:
    b > 17925
    c > 17925
    d > 17925
    print('Переменная (a) > 17925, Переменная (b) > 17925, Переменная (c) > 17925, Переменная (d) > 17925, ')
elif a == 17925:
    print('Переменные (a) == 17925, Переменные (b) == 17925, Переменные (c) == 17925, Переменные (d) == 17925, ')
else:
    print('Переменная (a) <!= 17925, Переменная (b) <!= 17925, Переменная (c) <!= 17925, Переменная (d) <!= 17925,')

# Ни один из переменных не равно и не больше